Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/hmatrix2.h
/* -------- HMATRIX2_PRBS : (HMATRIX2 Offset: 0x04) (R/W 32) Priority B for Slave -------- */
#define HMATRIX2_PRBS_RESETVALUE              _UINT32_(0x00)                                       /*  (HMATRIX2_PRBS) Priority B for Slave  Reset Value */

#define HMATRIX2_PRBS_M8PR_Pos                _UINT32_(0)                                          /* (HMATRIX2_PRBS) Master 8 Priority Position */
#define HMATRIX2_PRBS_M8PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRBS_M8PR_Pos)            /* (HMATRIX2_PRBS) Master 8 Priority Mask */
#define HMATRIX2_PRBS_M8PR(value)             (HMATRIX2_PRBS_M8PR_Msk & (_UINT32_(value) << HMATRIX2_PRBS_M8PR_Pos)) /* Assigment of value for M8PR in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_LQOSEN8_Pos             _UINT32_(2)                                          /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 8 Position */
#define HMATRIX2_PRBS_LQOSEN8_Msk             (_UINT32_(0x1) << HMATRIX2_PRBS_LQOSEN8_Pos)         /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 8 Mask */
#define HMATRIX2_PRBS_LQOSEN8(value)          (HMATRIX2_PRBS_LQOSEN8_Msk & (_UINT32_(value) << HMATRIX2_PRBS_LQOSEN8_Pos)) /* Assigment of value for LQOSEN8 in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_M9PR_Pos                _UINT32_(4)                                          /* (HMATRIX2_PRBS) Master 9 Priority Position */
#define HMATRIX2_PRBS_M9PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRBS_M9PR_Pos)            /* (HMATRIX2_PRBS) Master 9 Priority Mask */
#define HMATRIX2_PRBS_M9PR(value)             (HMATRIX2_PRBS_M9PR_Msk & (_UINT32_(value) << HMATRIX2_PRBS_M9PR_Pos)) /* Assigment of value for M9PR in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_LQOSEN9_Pos             _UINT32_(6)                                          /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 9 Position */
#define HMATRIX2_PRBS_LQOSEN9_Msk             (_UINT32_(0x1) << HMATRIX2_PRBS_LQOSEN9_Pos)         /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 9 Mask */
#define HMATRIX2_PRBS_LQOSEN9(value)          (HMATRIX2_PRBS_LQOSEN9_Msk & (_UINT32_(value) << HMATRIX2_PRBS_LQOSEN9_Pos)) /* Assigment of value for LQOSEN9 in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_M10PR_Pos               _UINT32_(8)                                          /* (HMATRIX2_PRBS) Master 10 Priority Position */
#define HMATRIX2_PRBS_M10PR_Msk               (_UINT32_(0x3) << HMATRIX2_PRBS_M10PR_Pos)           /* (HMATRIX2_PRBS) Master 10 Priority Mask */
#define HMATRIX2_PRBS_M10PR(value)            (HMATRIX2_PRBS_M10PR_Msk & (_UINT32_(value) << HMATRIX2_PRBS_M10PR_Pos)) /* Assigment of value for M10PR in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_LQOSEN10_Pos            _UINT32_(10)                                         /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 10 Position */
#define HMATRIX2_PRBS_LQOSEN10_Msk            (_UINT32_(0x1) << HMATRIX2_PRBS_LQOSEN10_Pos)        /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 10 Mask */
#define HMATRIX2_PRBS_LQOSEN10(value)         (HMATRIX2_PRBS_LQOSEN10_Msk & (_UINT32_(value) << HMATRIX2_PRBS_LQOSEN10_Pos)) /* Assigment of value for LQOSEN10 in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_M11PR_Pos               _UINT32_(12)                                         /* (HMATRIX2_PRBS) Master 11 Priority Position */
#define HMATRIX2_PRBS_M11PR_Msk               (_UINT32_(0x3) << HMATRIX2_PRBS_M11PR_Pos)           /* (HMATRIX2_PRBS) Master 11 Priority Mask */
#define HMATRIX2_PRBS_M11PR(value)            (HMATRIX2_PRBS_M11PR_Msk & (_UINT32_(value) << HMATRIX2_PRBS_M11PR_Pos)) /* Assigment of value for M11PR in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_LQOSEN11_Pos            _UINT32_(14)                                         /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 11 Position */
#define HMATRIX2_PRBS_LQOSEN11_Msk            (_UINT32_(0x1) << HMATRIX2_PRBS_LQOSEN11_Pos)        /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 11 Mask */
#define HMATRIX2_PRBS_LQOSEN11(value)         (HMATRIX2_PRBS_LQOSEN11_Msk & (_UINT32_(value) << HMATRIX2_PRBS_LQOSEN11_Pos)) /* Assigment of value for LQOSEN11 in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_M12PR_Pos               _UINT32_(16)                                         /* (HMATRIX2_PRBS) Master 12 Priority Position */
#define HMATRIX2_PRBS_M12PR_Msk               (_UINT32_(0x3) << HMATRIX2_PRBS_M12PR_Pos)           /* (HMATRIX2_PRBS) Master 12 Priority Mask */
#define HMATRIX2_PRBS_M12PR(value)            (HMATRIX2_PRBS_M12PR_Msk & (_UINT32_(value) << HMATRIX2_PRBS_M12PR_Pos)) /* Assigment of value for M12PR in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_LQOSEN12_Pos            _UINT32_(18)                                         /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 12 Position */
#define HMATRIX2_PRBS_LQOSEN12_Msk            (_UINT32_(0x1) << HMATRIX2_PRBS_LQOSEN12_Pos)        /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 12 Mask */
#define HMATRIX2_PRBS_LQOSEN12(value)         (HMATRIX2_PRBS_LQOSEN12_Msk & (_UINT32_(value) << HMATRIX2_PRBS_LQOSEN12_Pos)) /* Assigment of value for LQOSEN12 in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_M13PR_Pos               _UINT32_(20)                                         /* (HMATRIX2_PRBS) Master 13 Priority Position */
#define HMATRIX2_PRBS_M13PR_Msk               (_UINT32_(0x3) << HMATRIX2_PRBS_M13PR_Pos)           /* (HMATRIX2_PRBS) Master 13 Priority Mask */
#define HMATRIX2_PRBS_M13PR(value)            (HMATRIX2_PRBS_M13PR_Msk & (_UINT32_(value) << HMATRIX2_PRBS_M13PR_Pos)) /* Assigment of value for M13PR in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_LQOSEN13_Pos            _UINT32_(22)                                         /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 13 Position */
#define HMATRIX2_PRBS_LQOSEN13_Msk            (_UINT32_(0x1) << HMATRIX2_PRBS_LQOSEN13_Pos)        /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 13 Mask */
#define HMATRIX2_PRBS_LQOSEN13(value)         (HMATRIX2_PRBS_LQOSEN13_Msk & (_UINT32_(value) << HMATRIX2_PRBS_LQOSEN13_Pos)) /* Assigment of value for LQOSEN13 in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_M14PR_Pos               _UINT32_(24)                                         /* (HMATRIX2_PRBS) Master 14 Priority Position */
#define HMATRIX2_PRBS_M14PR_Msk               (_UINT32_(0x3) << HMATRIX2_PRBS_M14PR_Pos)           /* (HMATRIX2_PRBS) Master 14 Priority Mask */
#define HMATRIX2_PRBS_M14PR(value)            (HMATRIX2_PRBS_M14PR_Msk & (_UINT32_(value) << HMATRIX2_PRBS_M14PR_Pos)) /* Assigment of value for M14PR in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_LQOSEN14_Pos            _UINT32_(26)                                         /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 14 Position */
#define HMATRIX2_PRBS_LQOSEN14_Msk            (_UINT32_(0x1) << HMATRIX2_PRBS_LQOSEN14_Pos)        /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 14 Mask */
#define HMATRIX2_PRBS_LQOSEN14(value)         (HMATRIX2_PRBS_LQOSEN14_Msk & (_UINT32_(value) << HMATRIX2_PRBS_LQOSEN14_Pos)) /* Assigment of value for LQOSEN14 in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_M15PR_Pos               _UINT32_(28)                                         /* (HMATRIX2_PRBS) Master 15 Priority Position */
#define HMATRIX2_PRBS_M15PR_Msk               (_UINT32_(0x3) << HMATRIX2_PRBS_M15PR_Pos)           /* (HMATRIX2_PRBS) Master 15 Priority Mask */
#define HMATRIX2_PRBS_M15PR(value)            (HMATRIX2_PRBS_M15PR_Msk & (_UINT32_(value) << HMATRIX2_PRBS_M15PR_Pos)) /* Assigment of value for M15PR in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_LQOSEN15_Pos            _UINT32_(30)                                         /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 15 Position */
#define HMATRIX2_PRBS_LQOSEN15_Msk            (_UINT32_(0x1) << HMATRIX2_PRBS_LQOSEN15_Pos)        /* (HMATRIX2_PRBS) Latency Quality Of Service Enable for Master 15 Mask */
#define HMATRIX2_PRBS_LQOSEN15(value)         (HMATRIX2_PRBS_LQOSEN15_Msk & (_UINT32_(value) << HMATRIX2_PRBS_LQOSEN15_Pos)) /* Assigment of value for LQOSEN15 in the HMATRIX2_PRBS register */
#define HMATRIX2_PRBS_Msk                     _UINT32_(0x77777777)                                 /* (HMATRIX2_PRBS) Register Mask  */


/* -------- HMATRIX2_MCFG : (HMATRIX2 Offset: 0x00) (R/W 32) Master Configuration -------- */
#define HMATRIX2_MCFG_RESETVALUE              _UINT32_(0x02)                                       /*  (HMATRIX2_MCFG) Master Configuration  Reset Value */

#define HMATRIX2_MCFG_ULBT_Pos                _UINT32_(0)                                          /* (HMATRIX2_MCFG) Undefined Length Burst Type Position */
#define HMATRIX2_MCFG_ULBT_Msk                (_UINT32_(0x7) << HMATRIX2_MCFG_ULBT_Pos)            /* (HMATRIX2_MCFG) Undefined Length Burst Type Mask */
#define HMATRIX2_MCFG_ULBT(value)             (HMATRIX2_MCFG_ULBT_Msk & (_UINT32_(value) << HMATRIX2_MCFG_ULBT_Pos)) /* Assigment of value for ULBT in the HMATRIX2_MCFG register */
#define   HMATRIX2_MCFG_ULBT_INFINITE_Val     _UINT32_(0x0)                                        /* (HMATRIX2_MCFG) Infinite Length  */
#define   HMATRIX2_MCFG_ULBT_SINGLE_Val       _UINT32_(0x1)                                        /* (HMATRIX2_MCFG) Single Access  */
#define   HMATRIX2_MCFG_ULBT_FOUR_BEAT_Val    _UINT32_(0x2)                                        /* (HMATRIX2_MCFG) Four Beat Burst  */
#define   HMATRIX2_MCFG_ULBT_EIGHT_BEAT_Val   _UINT32_(0x3)                                        /* (HMATRIX2_MCFG) Eight Beat Burst  */
#define   HMATRIX2_MCFG_ULBT_SIXTEEN_BEAT_Val _UINT32_(0x4)                                        /* (HMATRIX2_MCFG) Sixteen Beat Burst  */
#define HMATRIX2_MCFG_ULBT_INFINITE           (HMATRIX2_MCFG_ULBT_INFINITE_Val << HMATRIX2_MCFG_ULBT_Pos) /* (HMATRIX2_MCFG) Infinite Length Position  */
#define HMATRIX2_MCFG_ULBT_SINGLE             (HMATRIX2_MCFG_ULBT_SINGLE_Val << HMATRIX2_MCFG_ULBT_Pos) /* (HMATRIX2_MCFG) Single Access Position  */
#define HMATRIX2_MCFG_ULBT_FOUR_BEAT          (HMATRIX2_MCFG_ULBT_FOUR_BEAT_Val << HMATRIX2_MCFG_ULBT_Pos) /* (HMATRIX2_MCFG) Four Beat Burst Position  */
#define HMATRIX2_MCFG_ULBT_EIGHT_BEAT         (HMATRIX2_MCFG_ULBT_EIGHT_BEAT_Val << HMATRIX2_MCFG_ULBT_Pos) /* (HMATRIX2_MCFG) Eight Beat Burst Position  */
#define HMATRIX2_MCFG_ULBT_SIXTEEN_BEAT       (HMATRIX2_MCFG_ULBT_SIXTEEN_BEAT_Val << HMATRIX2_MCFG_ULBT_Pos) /* (HMATRIX2_MCFG) Sixteen Beat Burst Position  */
#define HMATRIX2_MCFG_Msk                     _UINT32_(0x00000007)                                 /* (HMATRIX2_MCFG) Register Mask  */


/* -------- HMATRIX2_SCFG : (HMATRIX2 Offset: 0x40) (R/W 32) Slave Configuration -------- */
#define HMATRIX2_SCFG_RESETVALUE              _UINT32_(0x10)                                       /*  (HMATRIX2_SCFG) Slave Configuration  Reset Value */

#define HMATRIX2_SCFG_SLOT_CYCLE_Pos          _UINT32_(0)                                          /* (HMATRIX2_SCFG) Maximum Number of Allowed Cycles for a Burst Position */
#define HMATRIX2_SCFG_SLOT_CYCLE_Msk          (_UINT32_(0x1FF) << HMATRIX2_SCFG_SLOT_CYCLE_Pos)    /* (HMATRIX2_SCFG) Maximum Number of Allowed Cycles for a Burst Mask */
#define HMATRIX2_SCFG_SLOT_CYCLE(value)       (HMATRIX2_SCFG_SLOT_CYCLE_Msk & (_UINT32_(value) << HMATRIX2_SCFG_SLOT_CYCLE_Pos)) /* Assigment of value for SLOT_CYCLE in the HMATRIX2_SCFG register */
#define HMATRIX2_SCFG_DEFMSTR_TYPE_Pos        _UINT32_(16)                                         /* (HMATRIX2_SCFG) Default Master Type Position */
#define HMATRIX2_SCFG_DEFMSTR_TYPE_Msk        (_UINT32_(0x3) << HMATRIX2_SCFG_DEFMSTR_TYPE_Pos)    /* (HMATRIX2_SCFG) Default Master Type Mask */
#define HMATRIX2_SCFG_DEFMSTR_TYPE(value)     (HMATRIX2_SCFG_DEFMSTR_TYPE_Msk & (_UINT32_(value) << HMATRIX2_SCFG_DEFMSTR_TYPE_Pos)) /* Assigment of value for DEFMSTR_TYPE in the HMATRIX2_SCFG register */
#define   HMATRIX2_SCFG_DEFMSTR_TYPE_NO_DEFAULT_Val _UINT32_(0x0)                                        /* (HMATRIX2_SCFG) No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst.  */
#define   HMATRIX2_SCFG_DEFMSTR_TYPE_LAST_DEFAULT_Val _UINT32_(0x1)                                        /* (HMATRIX2_SCFG) Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave.  */
#define   HMATRIX2_SCFG_DEFMSTR_TYPE_FIXED_DEFAULT_Val _UINT32_(0x2)                                        /* (HMATRIX2_SCFG) Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave.  */
#define HMATRIX2_SCFG_DEFMSTR_TYPE_NO_DEFAULT (HMATRIX2_SCFG_DEFMSTR_TYPE_NO_DEFAULT_Val << HMATRIX2_SCFG_DEFMSTR_TYPE_Pos) /* (HMATRIX2_SCFG) No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst. Position  */
#define HMATRIX2_SCFG_DEFMSTR_TYPE_LAST_DEFAULT (HMATRIX2_SCFG_DEFMSTR_TYPE_LAST_DEFAULT_Val << HMATRIX2_SCFG_DEFMSTR_TYPE_Pos) /* (HMATRIX2_SCFG) Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave. Position  */
#define HMATRIX2_SCFG_DEFMSTR_TYPE_FIXED_DEFAULT (HMATRIX2_SCFG_DEFMSTR_TYPE_FIXED_DEFAULT_Val << HMATRIX2_SCFG_DEFMSTR_TYPE_Pos) /* (HMATRIX2_SCFG) Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave. Position  */
#define HMATRIX2_SCFG_FIXED_DEFMSTR_Pos       _UINT32_(18)                                         /* (HMATRIX2_SCFG) Fixed Index of Default Master Position */
#define HMATRIX2_SCFG_FIXED_DEFMSTR_Msk       (_UINT32_(0xF) << HMATRIX2_SCFG_FIXED_DEFMSTR_Pos)   /* (HMATRIX2_SCFG) Fixed Index of Default Master Mask */
#define HMATRIX2_SCFG_FIXED_DEFMSTR(value)    (HMATRIX2_SCFG_FIXED_DEFMSTR_Msk & (_UINT32_(value) << HMATRIX2_SCFG_FIXED_DEFMSTR_Pos)) /* Assigment of value for FIXED_DEFMSTR in the HMATRIX2_SCFG register */
#define HMATRIX2_SCFG_Msk                     _UINT32_(0x003F01FF)                                 /* (HMATRIX2_SCFG) Register Mask  */


/* -------- HMATRIX2_MRCR : (HMATRIX2 Offset: 0x100) (R/W 32) Master Remap Control -------- */
#define HMATRIX2_MRCR_RESETVALUE              _UINT32_(0x00)                                       /*  (HMATRIX2_MRCR) Master Remap Control  Reset Value */

