Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/hmatrix2.h
#define HMATRIX2_MRCR_RCB0_Pos                _UINT32_(0)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 0 Position */
#define HMATRIX2_MRCR_RCB0_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB0_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 0 Mask */
#define HMATRIX2_MRCR_RCB0(value)             (HMATRIX2_MRCR_RCB0_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB0_Pos)) /* Assigment of value for RCB0 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB0_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB0_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB0_DIS                (HMATRIX2_MRCR_RCB0_DIS_Val << HMATRIX2_MRCR_RCB0_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB0_ENA                (HMATRIX2_MRCR_RCB0_ENA_Val << HMATRIX2_MRCR_RCB0_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB1_Pos                _UINT32_(1)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 1 Position */
#define HMATRIX2_MRCR_RCB1_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB1_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 1 Mask */
#define HMATRIX2_MRCR_RCB1(value)             (HMATRIX2_MRCR_RCB1_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB1_Pos)) /* Assigment of value for RCB1 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB1_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB1_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB1_DIS                (HMATRIX2_MRCR_RCB1_DIS_Val << HMATRIX2_MRCR_RCB1_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB1_ENA                (HMATRIX2_MRCR_RCB1_ENA_Val << HMATRIX2_MRCR_RCB1_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB2_Pos                _UINT32_(2)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 2 Position */
#define HMATRIX2_MRCR_RCB2_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB2_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 2 Mask */
#define HMATRIX2_MRCR_RCB2(value)             (HMATRIX2_MRCR_RCB2_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB2_Pos)) /* Assigment of value for RCB2 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB2_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB2_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB2_DIS                (HMATRIX2_MRCR_RCB2_DIS_Val << HMATRIX2_MRCR_RCB2_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB2_ENA                (HMATRIX2_MRCR_RCB2_ENA_Val << HMATRIX2_MRCR_RCB2_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB3_Pos                _UINT32_(3)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 3 Position */
#define HMATRIX2_MRCR_RCB3_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB3_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 3 Mask */
#define HMATRIX2_MRCR_RCB3(value)             (HMATRIX2_MRCR_RCB3_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB3_Pos)) /* Assigment of value for RCB3 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB3_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB3_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB3_DIS                (HMATRIX2_MRCR_RCB3_DIS_Val << HMATRIX2_MRCR_RCB3_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB3_ENA                (HMATRIX2_MRCR_RCB3_ENA_Val << HMATRIX2_MRCR_RCB3_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB4_Pos                _UINT32_(4)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 4 Position */
#define HMATRIX2_MRCR_RCB4_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB4_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 4 Mask */
#define HMATRIX2_MRCR_RCB4(value)             (HMATRIX2_MRCR_RCB4_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB4_Pos)) /* Assigment of value for RCB4 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB4_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB4_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB4_DIS                (HMATRIX2_MRCR_RCB4_DIS_Val << HMATRIX2_MRCR_RCB4_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB4_ENA                (HMATRIX2_MRCR_RCB4_ENA_Val << HMATRIX2_MRCR_RCB4_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB5_Pos                _UINT32_(5)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 5 Position */
#define HMATRIX2_MRCR_RCB5_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB5_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 5 Mask */
#define HMATRIX2_MRCR_RCB5(value)             (HMATRIX2_MRCR_RCB5_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB5_Pos)) /* Assigment of value for RCB5 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB5_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB5_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB5_DIS                (HMATRIX2_MRCR_RCB5_DIS_Val << HMATRIX2_MRCR_RCB5_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB5_ENA                (HMATRIX2_MRCR_RCB5_ENA_Val << HMATRIX2_MRCR_RCB5_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB6_Pos                _UINT32_(6)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 6 Position */
#define HMATRIX2_MRCR_RCB6_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB6_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 6 Mask */
#define HMATRIX2_MRCR_RCB6(value)             (HMATRIX2_MRCR_RCB6_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB6_Pos)) /* Assigment of value for RCB6 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB6_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB6_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB6_DIS                (HMATRIX2_MRCR_RCB6_DIS_Val << HMATRIX2_MRCR_RCB6_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB6_ENA                (HMATRIX2_MRCR_RCB6_ENA_Val << HMATRIX2_MRCR_RCB6_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB7_Pos                _UINT32_(7)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 7 Position */
#define HMATRIX2_MRCR_RCB7_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB7_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 7 Mask */
#define HMATRIX2_MRCR_RCB7(value)             (HMATRIX2_MRCR_RCB7_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB7_Pos)) /* Assigment of value for RCB7 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB7_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB7_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB7_DIS                (HMATRIX2_MRCR_RCB7_DIS_Val << HMATRIX2_MRCR_RCB7_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB7_ENA                (HMATRIX2_MRCR_RCB7_ENA_Val << HMATRIX2_MRCR_RCB7_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB8_Pos                _UINT32_(8)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 8 Position */
#define HMATRIX2_MRCR_RCB8_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB8_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 8 Mask */
#define HMATRIX2_MRCR_RCB8(value)             (HMATRIX2_MRCR_RCB8_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB8_Pos)) /* Assigment of value for RCB8 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB8_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB8_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB8_DIS                (HMATRIX2_MRCR_RCB8_DIS_Val << HMATRIX2_MRCR_RCB8_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB8_ENA                (HMATRIX2_MRCR_RCB8_ENA_Val << HMATRIX2_MRCR_RCB8_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB9_Pos                _UINT32_(9)                                          /* (HMATRIX2_MRCR) Remap Command Bit for Master 9 Position */
#define HMATRIX2_MRCR_RCB9_Msk                (_UINT32_(0x1) << HMATRIX2_MRCR_RCB9_Pos)            /* (HMATRIX2_MRCR) Remap Command Bit for Master 9 Mask */
#define HMATRIX2_MRCR_RCB9(value)             (HMATRIX2_MRCR_RCB9_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB9_Pos)) /* Assigment of value for RCB9 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB9_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB9_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB9_DIS                (HMATRIX2_MRCR_RCB9_DIS_Val << HMATRIX2_MRCR_RCB9_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB9_ENA                (HMATRIX2_MRCR_RCB9_ENA_Val << HMATRIX2_MRCR_RCB9_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB10_Pos               _UINT32_(10)                                         /* (HMATRIX2_MRCR) Remap Command Bit for Master 10 Position */
#define HMATRIX2_MRCR_RCB10_Msk               (_UINT32_(0x1) << HMATRIX2_MRCR_RCB10_Pos)           /* (HMATRIX2_MRCR) Remap Command Bit for Master 10 Mask */
#define HMATRIX2_MRCR_RCB10(value)            (HMATRIX2_MRCR_RCB10_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB10_Pos)) /* Assigment of value for RCB10 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB10_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB10_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB10_DIS               (HMATRIX2_MRCR_RCB10_DIS_Val << HMATRIX2_MRCR_RCB10_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB10_ENA               (HMATRIX2_MRCR_RCB10_ENA_Val << HMATRIX2_MRCR_RCB10_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB11_Pos               _UINT32_(11)                                         /* (HMATRIX2_MRCR) Remap Command Bit for Master 11 Position */
#define HMATRIX2_MRCR_RCB11_Msk               (_UINT32_(0x1) << HMATRIX2_MRCR_RCB11_Pos)           /* (HMATRIX2_MRCR) Remap Command Bit for Master 11 Mask */
#define HMATRIX2_MRCR_RCB11(value)            (HMATRIX2_MRCR_RCB11_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB11_Pos)) /* Assigment of value for RCB11 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB11_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB11_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB11_DIS               (HMATRIX2_MRCR_RCB11_DIS_Val << HMATRIX2_MRCR_RCB11_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB11_ENA               (HMATRIX2_MRCR_RCB11_ENA_Val << HMATRIX2_MRCR_RCB11_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB12_Pos               _UINT32_(12)                                         /* (HMATRIX2_MRCR) Remap Command Bit for Master 12 Position */
#define HMATRIX2_MRCR_RCB12_Msk               (_UINT32_(0x1) << HMATRIX2_MRCR_RCB12_Pos)           /* (HMATRIX2_MRCR) Remap Command Bit for Master 12 Mask */
#define HMATRIX2_MRCR_RCB12(value)            (HMATRIX2_MRCR_RCB12_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB12_Pos)) /* Assigment of value for RCB12 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB12_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB12_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB12_DIS               (HMATRIX2_MRCR_RCB12_DIS_Val << HMATRIX2_MRCR_RCB12_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB12_ENA               (HMATRIX2_MRCR_RCB12_ENA_Val << HMATRIX2_MRCR_RCB12_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB13_Pos               _UINT32_(13)                                         /* (HMATRIX2_MRCR) Remap Command Bit for Master 13 Position */
#define HMATRIX2_MRCR_RCB13_Msk               (_UINT32_(0x1) << HMATRIX2_MRCR_RCB13_Pos)           /* (HMATRIX2_MRCR) Remap Command Bit for Master 13 Mask */
#define HMATRIX2_MRCR_RCB13(value)            (HMATRIX2_MRCR_RCB13_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB13_Pos)) /* Assigment of value for RCB13 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB13_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB13_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB13_DIS               (HMATRIX2_MRCR_RCB13_DIS_Val << HMATRIX2_MRCR_RCB13_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB13_ENA               (HMATRIX2_MRCR_RCB13_ENA_Val << HMATRIX2_MRCR_RCB13_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB14_Pos               _UINT32_(14)                                         /* (HMATRIX2_MRCR) Remap Command Bit for Master 14 Position */
#define HMATRIX2_MRCR_RCB14_Msk               (_UINT32_(0x1) << HMATRIX2_MRCR_RCB14_Pos)           /* (HMATRIX2_MRCR) Remap Command Bit for Master 14 Mask */
#define HMATRIX2_MRCR_RCB14(value)            (HMATRIX2_MRCR_RCB14_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB14_Pos)) /* Assigment of value for RCB14 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB14_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB14_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB14_DIS               (HMATRIX2_MRCR_RCB14_DIS_Val << HMATRIX2_MRCR_RCB14_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB14_ENA               (HMATRIX2_MRCR_RCB14_ENA_Val << HMATRIX2_MRCR_RCB14_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB15_Pos               _UINT32_(15)                                         /* (HMATRIX2_MRCR) Remap Command Bit for Master 15 Position */
#define HMATRIX2_MRCR_RCB15_Msk               (_UINT32_(0x1) << HMATRIX2_MRCR_RCB15_Pos)           /* (HMATRIX2_MRCR) Remap Command Bit for Master 15 Mask */
#define HMATRIX2_MRCR_RCB15(value)            (HMATRIX2_MRCR_RCB15_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB15_Pos)) /* Assigment of value for RCB15 in the HMATRIX2_MRCR register */
#define   HMATRIX2_MRCR_RCB15_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIX2_MRCR) Disable remapped address decoding for master  */
#define   HMATRIX2_MRCR_RCB15_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIX2_MRCR) Enable remapped address decoding for master  */
#define HMATRIX2_MRCR_RCB15_DIS               (HMATRIX2_MRCR_RCB15_DIS_Val << HMATRIX2_MRCR_RCB15_Pos) /* (HMATRIX2_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_RCB15_ENA               (HMATRIX2_MRCR_RCB15_ENA_Val << HMATRIX2_MRCR_RCB15_Pos) /* (HMATRIX2_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIX2_MRCR_Msk                     _UINT32_(0x0000FFFF)                                 /* (HMATRIX2_MRCR) Register Mask  */

#define HMATRIX2_MRCR_RCB_Pos                 _UINT32_(0)                                          /* (HMATRIX2_MRCR Position) Remap Command Bit for Master x5 */
#define HMATRIX2_MRCR_RCB_Msk                 (_UINT32_(0xFFFF) << HMATRIX2_MRCR_RCB_Pos)          /* (HMATRIX2_MRCR Mask) RCB */
#define HMATRIX2_MRCR_RCB(value)              (HMATRIX2_MRCR_RCB_Msk & (_UINT32_(value) << HMATRIX2_MRCR_RCB_Pos)) 

/* -------- HMATRIX2_SFR : (HMATRIX2 Offset: 0x110) (R/W 32) Special Function -------- */
#define HMATRIX2_SFR_RESETVALUE               _UINT32_(0x00)                                       /*  (HMATRIX2_SFR) Special Function  Reset Value */

#define HMATRIX2_SFR_SFR_Pos                  _UINT32_(0)                                          /* (HMATRIX2_SFR) Special Function Register Position */
#define HMATRIX2_SFR_SFR_Msk                  (_UINT32_(0xFFFFFFFF) << HMATRIX2_SFR_SFR_Pos)       /* (HMATRIX2_SFR) Special Function Register Mask */
#define HMATRIX2_SFR_SFR(value)               (HMATRIX2_SFR_SFR_Msk & (_UINT32_(value) << HMATRIX2_SFR_SFR_Pos)) /* Assigment of value for SFR in the HMATRIX2_SFR register */
#define HMATRIX2_SFR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (HMATRIX2_SFR) Register Mask  */


